rails/parts/app/controllers/hubs_controller.rb

  def show
    @hub = Hub.find(params[:id])
---
SELECT * FROM "hubs" WHERE ("hubs"."id" = 316632762)

  def edit
    @hub = Hub.find(params[:id])
---
SELECT * FROM "hubs" WHERE ("hubs"."id" = 316632762)

  def update
    @hub = Hub.find(params[:id])
---
SELECT * FROM "hubs" WHERE ("hubs"."id" = 316632762)

  def destroy
    @hub = Hub.find(params[:id])
    @hub.destroy
---
SELECT * FROM "hubs" WHERE ("hubs"."id" = 316632762)
DELETE FROM "hubs" WHERE "id" = 316632762