rails/parts/app/controllers/rims_controller.rb

SELECT * FROM "rims" WHERE ("rims"."id" = 793168374)
---
  def show
    @rim = Rim.find(params[:id])

SELECT * FROM "rims" WHERE ("rims"."id" = 793168374)
---
  def edit
    @rim = Rim.find(params[:id])

SELECT * FROM "rims" WHERE ("rims"."id" = 793168374)
---
  def update
    @rim = Rim.find(params[:id])

SELECT * FROM "rims" WHERE ("rims"."id" = 793168374)
DELETE FROM "rims" WHERE "id" = 793168374
---
  def destroy
    @rim = Rim.find(params[:id])
    @rim.destroy