rails/parts/app/controllers/wheels_controller.rb

  def show
    @wheel = Wheel.find(params[:id])
---
SELECT * FROM "wheels" WHERE ("wheels"."id" = 682576799)

  def edit
    @wheel = Wheel.find(params[:id])
---
SELECT * FROM "wheels" WHERE ("wheels"."id" = 682576799)

  def create
    @wheel = Wheel.new(params[:wheel])

    respond_to do |format|
      if @wheel.save
---
INSERT INTO "wheels" ("updated_at", "hub_id", "spoke_pattern", "note", "rim_id", "created_at") VALUES('2009-05-04 06:48:52', NULL, NULL, NULL, NULL, '2009-05-04 06:48:52')

  def update
    @wheel = Wheel.find(params[:id])
---
SELECT * FROM "wheels" WHERE ("wheels"."id" = 682576799)

  def destroy
    @wheel = Wheel.find(params[:id])
    @wheel.destroy
---
SELECT * FROM "wheels" WHERE ("wheels"."id" = 682576799)
DELETE FROM "wheels" WHERE "id" = 682576799